{
    "fullname": "Ariq Fachry Ramadhan",
    "nickname": "Ariq",
    "gender": "Male",
    "email": "ariqfachry2611@gmail.com",
    "telegram": "@ariqfachry",
    "linkedin": "https://www.linkedin.com/in/ariqfachry/",
    "overview": "Backend Engineer with 2+ years of experience building scalable web services using NestJS, TypeScript, and GCP as primary cloud infrastructure. Strong foundation in system design, API development, caching strategies, and production deployment using Cloud Run. Recently explored AI Engineering through hands-on project implementations with LLM APIs, LangChain, and FastAPI. Comfortable working in Agile teams, passionate about developer growth, and eager to contribute to impactful and user-centric products. ",
    "experience": [
        {
            "company": "Tokocrypto",
            "employement_type": "Internship",
            "role": "Backend Developer",
            "start_date": "April 2022",
            "end_date": "August 2022",
            "descriptions": {
                "achievements": [
                    "Helped the company solve internal issues by developing the Asset Management System and Technology Portal Web Application as a backend developer in a different team",
                    "Wrote understandable code and implemented a clean backend architecture using NestJS framework (Typescript)",
                    "Created clean and well-managed API documentation using Postman and Swagger for team collaboration",
                    "Worked with Agile and Scrum Methodologies, utilizing Jira Software to track project issues"
                ],
                "skills_used": [
                    "NestJS",
                    "Typescript",
                    "NodeJs",
                    "Agile Software Development",
                    "Web Development"
                ]
            }
        },
        {
            "company": "Nanobee",
            "employement_type": "Part-Time",
            "role": "Software Engineer",
            "start_date": "December 2022",
            "end_date": "December 2022",
            "descriptions": {
                "achievements": [
                    "Helped the company by developing a Telegram bot using Typescript, Node.js, and Firebase Firestore"
                ],
                "skills_used": [
                    "Typescript",
                    "Firebase",
                    "Cloud Firestore",
                    "NodeJs"
                ]
            }
        },
        {
            "company": "Untukmu.AI",
            "employement_type": "Full-Time",
            "role": "Junior Backend Developer",
            "start_date": "June 2023",
            "end_date": "Present",
            "descriptions": {
                "summary": "Experienced in building scalable backend systems using NestJS and FastAPI, with strong focus on performance optimization, caching, and system reliability. Contributed to AI-driven product development and large-scale gamification initiatives with millions of users. Proficient in modern backend stacks and GCP infrastructure, with hands-on experience deploying microservices and collaborating in fast-paced, cross-functional startup teams.",
                "achievements": [
                    "Built and refined NestJS-based backend systems for key operational modules such as orders, logistics, and merchants. Boosted API performance by implementing Redis caching and validating improvements using K6 performance testing.",
                    "Built and collaborated on the prototype of an AI-powered chatbot using FastAPI and OpenAI LLM, aimed at personalized gift recommendations. Integrated SerpAPI and Blibli’s product data to enrich gift suggestions, resulting in over 20,000+ active users.",
                    "Developed backend systems for platform gamification supporting the ForU AI token airdrop in Telegram Miniapp, serving a user base of over 8 million users.",
                    "Worked across a modern stack including PostgreSQL, MySQL, Redis, ClickHouse, and GCP for deployment infrastructure. Frequently initiated and configured Cloud Run services for new microservices and internal tools.",
                    "Collaborated with cross-functional teams using Lark and adapted to a fast-paced startup environment focused on rapid delivery and scalability, while navigating limited formal testing or CI/CD infrastructure."
                ],
                "skills_used": [
                    "NestJS",
                    "Typescript",
                    "Redis",
                    "Memcache",
                    "NodeJs",
                    "Google Cloud Platform (GCP): CloudRun, CloudSQL, Compute Engine, Cloud Bucket (OSS)",
                    "PostgreSQL",
                    "ClickHouse"
                ]
            }
        }
    ],
    "education": [
        {
            "level": "Bachelor of Applied Science",
            "school": "Universitas Negeri Surabaya",
            "field_of_study": "Computer Science",
            "title": "S.Tr.Kom / BASc",
            "start_date": "August 2019",
            "end_date": "Jul 2023",
            "grade": "GPA 3.81"
        }
    ],
    "informal_education": [
        {
            "Organization": "Ruangguru",
            "name": "Ruangguru Career Acceleration Program",
            "program": "Backend Developer",
            "start_date": "August 2022",
            "end_date": "December 2022",
            "descriptions": {
                "achievements": [
                    "Completed all courses given by Ruangguru with final GPA of 4,00",
                    "Contributed to Ruangguru CAMP as a Mentor Assistant, aiding other students in learning and achieving excellent final GPA scores",
                    "Gained experiences and knowledge in basic Backend Golang developments and unit testing"
                ],
                "skills": [
                    "Agile Methodologies",
                    "Software Engineering",
                    "Golang",
                    "PostgreSQL",
                    "Google Cloud Platform (GCP)",
                    "Software Deployment",
                    "Unit Testing"
                ]
            }
        },
        [
            {
                "organization": "Ruangguru",
                "name": "AI Mastering Program ",
                "program": "AI Engineering",
                "start_date": "March 2025",
                "end_date": "June 2025",
                "descriptions": {
                    "achievements": [
                        "Completed a comprehensive program covering practical topics in machine learning, computer vision, and large language models (LLMs).",
                        "Individually developed an AI-powered self-improvement chatbot deployed on Telegram Bot, using FastAPI for backend integration via webhook while core functionalities are implemented with LangChain and OpenAI. Including several agent-based prompting and tool usage. Utilized MongoDB for conversational memory storage. As well integrated HuggingFace models for daily mood analysis."
                    ],
                    "skills": [
                        "Python",
                        "FastAPI",
                        "LangChain",
                        "OpenAI",
                        "MongoDB"
                    ]
                }
            }
        ]
    ],
    "skills": {
        "software_engineering_related": {
            "programming_language": [
                {
                    "name": "Javascript / Typescript",
                    "level": "Advanced",
                    "note": "Language I used in daily basis for about 3 years"
                },
                {
                    "name": "Golang",
                    "level": "Beginner",
                    "note": "Still exploring and mastering"
                },
                {
                    "name": "Python",
                    "level": "Beginner",
                    "note": "Still exploring and mastering, had a few projects for Data analytics"
                },
                {
                    "name": "C#",
                    "level": "Intermediate",
                    "note": "Had a 2 game projects that use Unity C#"
                }
            ],
            "frameworks": [
                {
                    "name": "NestJS",
                    "level": "Advanced",
                    "note": "Main framework used in daily work and projects"
                },
                {
                    "name": "Next.js",
                    "level": "Intermediate",
                    "note": "Used in several fullstack projects and internship work"
                },
                {
                    "name": "FastAPI",
                    "level": "Beginner",
                    "note": "Used in AI-integrated chatbot project"
                }
            ],
            "databases": [
                {
                    "name": "MySQL",
                    "level": "Intermediate",
                    "note": "Used in several major projects"
                },
                {
                    "name": "MongoDB",
                    "level": "Intermediate",
                    "note": "Used in AI chatbot project"
                },
                {
                    "name": "Cloud Firestore",
                    "level": "Beginner",
                    "note": "Used in Telegram bot project at Nanobee"
                },
                {
                    "name": "PostgreSQL",
                    "level": "Beginner",
                    "note": null
                }
            ],
            "cloud_platforms": [
                {
                    "name": "Google Cloud Platform (GCP)",
                    "level": "Intermediate",
                    "note": "Used CloudRun, CloudSQL, Cloud Bucket, Compute Engine"
                }
            ],
            "devops_tools": [
                {
                    "name": "Docker",
                    "level": "Intermediate",
                    "note": "Used for containerization in projects like Pofits, and several company projects"
                },
                {
                    "name": "Vercel",
                    "level": "Beginner",
                    "note": "Used for frontend deployment in personal projects"
                }
            ],
            "monitoring_and_testing": [
                {
                    "name": "k6",
                    "level": "Beginner",
                    "note": "Used for performance testing in production APIs"
                },
                {
                    "name": "Swagger",
                    "level": "Advanced",
                    "note": "Used for API documentation and collaboration"
                }
            ],
            "other_technologies": [
                {
                    "name": "Redis",
                    "level": "Intermediate",
                    "note": "Used for caching strategies in production"
                },
                {
                    "name": "Unity 2D",
                    "level": "Intermediate",
                    "note": "Used in game development for Lara Tales"
                }
            ],
            "methodologies": [
                {
                    "name": "Agile & Scrum",
                    "level": "Intermediate",
                    "note": "Used in daily collaboration and project management with Jira"
                }
            ]
        }
    },
    "projects": [
        {
            "title": "Rune AI - Telegram Productivity Chatbot",
            "description": "Telegram-based AI chatbot that helps users achieve long-term goals through gamified daily task tracking. Rune AI enables goal breakdown into daily objectives, supports reflective journaling with sentiment analysis, and delivers personalized encouragement using OpenAI LLM and HuggingFace classifiers.",
            "year": 2024,
            "project_type": "Personal Project",
            "technologies_used": [
                "Python",
                "FastAPI",
                "MongoDB",
                "OpenAI GPT",
                "HuggingFace Transformers",
                "Telegram Bot API"
            ]
        },
        {
            "title": "Pofits - Personal Finance Web App",
            "description": "Personal finance management app designed to transform the way you budget and save. Experience the power of envelope budgeting strategy, seamlessly integrated with advanced expense and income category modules. Users can also set financial goals and let the system guide you every step of the way, tracking your progress towards savings and investment milestones.",
            "year": 2022,
            "project_type": "College Thesis Product (Individual Project)",
            "technologies_used": [
                "Nest.Js",
                "Typescript",
                "MySQL",
                "Next.Js",
                "Docker",
                "Ubuntu VPS",
                "Vercel"
            ]
        },
        {
            "title": "GenPieBot",
            "description": "GenPieBot is a Telegram bot that will help the user to fetch their genshin impact in-game profile data. User can inspect the data such as their nickname, adventure rank, world level, statistic of showcased characters and more. This personal project developed using Typescript NodeJs.",
            "year": 2022,
            "project_type": "Personal",
            "technologies_used": [
                "Node",
                "MySQL",
                "Next.Js",
                "Ubuntu VPS",
                "Vercel"
            ]
        },
        {
            "title": "TRAST - Technology Request Administration System in Tokocrypto",
            "description": "TRAST is a web based application aimed for managing requests from outside tech departments in Tokocrypto to the tech departments. Requests that can be requested in this application such as: Creating a new system, bug fixing, application improvement, and others tech related things. This application developed using NextJs for the frontend, NestJs for the backend, and MySQL for the database. Within this project, i took the role as backend developer",
            "year": 2022,
            "project_type": "Internship Project",
            "technologies_used": [
                "Nest.Js",
                "Typescript",
                "MySQL",
                "Swagger",
                "AliOSS"
            ]
        },
        {
            "title": "TAMI - Tokocrypto Asset Management Inventory (2022)",
            "description": "Web based application aimed for managing assets including its activites such as propose asset, repair an asset, returning assets from employee, and acquisitioning assets. Developed using NextJs for the frontend, NestJs for the backend, and MySQL for the database. In this project team, i took the role as backend developer.",
            "year": 2022,
            "project_type": "Internship Project",
            "technologies_used": [
                "Nest.Js",
                "Typescript",
                "MySQL",
                "Swagger",
                "AliOSS"
            ]
        },
        {
            "title": "Lara Tales",
            "description": "Lara Tales is an Action 2D Platformer game and consist several stages with enemy and bosses. This game is developed using Unity Engine. In this project i took the role as the main programmer while my team consist of story writer, and area designer.",
            "year": 2021,
            "project_type": "Team College Project",
            "technologies_used": [
                "Unity 2D",
                "C#"
            ]
        },
        {
            "title": "Spotify Wrapped Twitter Analytics",
            "description": "Big data Analysis on Most Tagged Artist in Spotify Wrapped Indonesia 2021. Analyzed by retrieving tweets uploaded on Twitter with the hashtag of SpotifyWrappedIndonesia and analyzed using Pyhton and Google Collab as a python notebook.",
            "year": 2021,
            "project_type": "Individual College Project",
            "technologies_used": [
                "Python",
                "Google Collab"
            ]
        }
    ]
}